In [1]:
import numpy as np
import pandas as pd

Merging 2 dataframe

In [ ]:
#dataframe 1: Employee details
df1 = {
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'IT']
}
df1 = pd.DataFrame(df1)

#dataframe 2: Employee salaries
df2 = {
    'EmployeeID': [1, 2, 3, 5],
    'Salary': [50000, 60000, 55000, 70000],
    'bonus': [5000, 6000, 5500, 7000]
}
df2 = pd.DataFrame(df2)

In [11]:
df1

   EmployeeID     Name Department
0           1    Alice         HR
1           2      Bob         IT
2           3  Charlie    Finance
3           4    David         IT

In [12]:
df2

   EmployeeID  Salary  bonus
0           1   50000   5000
1           2   60000   6000
2           3   55000   5500
3           5   70000   7000

In [ ]:
# Merge the two dataframes on 'EmployeeID' using an inner join
pd.merge(df1, df2, on='EmployeeID', how='inner')

   EmployeeID     Name Department  Salary  bonus
0           1    Alice         HR   50000   5000
1           2      Bob         IT   60000   6000
2           3  Charlie    Finance   55000   5500

In [ ]:
#outer join uses all the data from both the dataframes and fills in NaN for missing values
pd.merge(df1, df2, on='EmployeeID', how='outer')

   EmployeeID     Name Department   Salary   bonus
0           1    Alice         HR  50000.0  5000.0
1           2      Bob         IT  60000.0  6000.0
2           3  Charlie    Finance  55000.0  5500.0
3           4    David         IT      NaN     NaN
4           5      NaN        NaN  70000.0  7000.0

In [15]:
#left join uses all the data from the left dataframe and fills in NaN for missing values from the right dataframe
pd.merge(df1, df2, on='EmployeeID', how='left')

   EmployeeID     Name Department   Salary   bonus
0           1    Alice         HR  50000.0  5000.0
1           2      Bob         IT  60000.0  6000.0
2           3  Charlie    Finance  55000.0  5500.0
3           4    David         IT      NaN     NaN

In [16]:
#right join uses all the data from the right dataframe and fills in NaN for missing values from the left dataframe
pd.merge(df1, df2, on='EmployeeID', how='right')

   EmployeeID     Name Department  Salary  bonus
0           1    Alice         HR   50000   5000
1           2      Bob         IT   60000   6000
2           3  Charlie    Finance   55000   5500
3           5      NaN        NaN   70000   7000

Concatinatiom of 2 dataframe

In [17]:
#concatinate the two dataframes vertically (stacking them on top of each other)

df1 = pd.DataFrame({
    'a': ['a1' , 'a2', 'a3'],
    'b': ['b1' , 'b2', 'b3'],   
    'c': ['c1' , 'c2', 'c3']
})
df2 = pd.DataFrame({
    'a': ['a4' , 'a5', 'a6'],
    'b': ['b4' , 'b5', 'b6'],   
    'c': ['c4' , 'c5', 'c6']
})

In [18]:
df1

    a   b   c
0  a1  b1  c1
1  a2  b2  c2
2  a3  b3  c3

In [19]:
df2

    a   b   c
0  a4  b4  c4
1  a5  b5  c5
2  a6  b6  c6

In [20]:
#concat function is used to concatenate the two dataframes vertically
pd.concat([df1, df2])

    a   b   c
0  a1  b1  c1
1  a2  b2  c2
2  a3  b3  c3
0  a4  b4  c4
1  a5  b5  c5
2  a6  b6  c6

In [ ]:
#concat function is used to concatenate the two dataframes horizontally (side by side)
pd.concat([df1, df2], axis=1)

    a   b   c   a   b   c
0  a1  b1  c1  a4  b4  c4
1  a2  b2  c2  a5  b5  c5
2  a3  b3  c3  a6  b6  c6

Joining 2 dataframe

In [30]:
df1 = pd.DataFrame({
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35]
})
df2 = pd.DataFrame({
    'city' : ['New York', 'Los Angeles', 'Chicago']
})

In [27]:
df1

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [32]:
df2

          city
0     New York
1  Los Angeles
2      Chicago

In [ ]:
#join function is used to join the two dataframes on their index
df1.join(df2)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
#join function is used to join the two dataframes on their index and add suffixes to the overlapping column names
df1.join(df2, lsuffix='_left', rsuffix='_right')

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago